//1. დაწერეთ ფუნქცია, რომელიც პარამეტრად მიიღებს ობიექტს და დააბრუნებს მის name 
//ფროფერთის მნიშვნელობას. თუ name ფროფერთი არ გააჩნია, დაარეთარნეთ null.

//2. გადააწყეთ პირველი დავალება try/catch-ის გამოყენებით. თუ name ფროფერთი არ გააჩნია,
// გაისროლეთ ერორი და შემდეგ გაუმკლავდით.
//3. დაწერეთ ფუნქცია, რომელიც იღებს ორ რიცხვს პარამეტრებად და ცდილობს მათ გაყოფას. 
//თუ რომელიმე რიცხვის ტიპის არაა, გაისროლეთ ერორი. ასევე გაუმკლავდით იმ შემთხვევასაც, როცა
// მეორე რიცხვი 0-ია (0-ზე გაყოფა არ შეიძლება).
// function divide(a, b){
//     if(isNaN(a) || isNaN(b)){
//         throw new Error('both inputs must be numbers')
//     }
//     if(b === 0){
//         throw new Error('cant divide by 0') 
//     }

//     return a / b;
// }
// let firstNumber = Number(prompt('enter first number'))
// let secondNumber = Number(prompt('enter second number'))
// try {
//     console.log(divide(firstNumber, secondNumber))
// } catch(error){
//     console.log( error.message)
// }

//4. დაწერეთ ფუნქცია სახელად promptAge, რომელიც შეეკითხება მომხმარებელს თავის ასაკს და
// თუ არასწორად იქნება ასაკი შემოყვანილი, გასივრის ერორს. ეს ფუნქცია გამოიძახეთ isAdult ფუნქციაში,
// რომელიც ადგენს არის თუ არა მომხმარებელი სრულწლოვანი. გამოიყენეთ try/catch ერორების გასამკლავებლად.



//5. დაწერეთ ფუნქცია, რომელიც ცდილობს JSON სტრინგის პარსინგს (მაგალითად სტრინგად ჩაწერილ
// ობიექტს გადაიყვანს ობიექტში). გამოიყენეთ try/catch იმ ქეისებისთვის, როცა JSON სტრინგი არავალიდურია.
//6. დაწერეთ ფუნქცია, რომელიც აგზავნის რექვესთს GitHub-ის API-ზე და მოაქვს გითჰაბის იუზერის დატა.
// (მაგალითად: https://api.github.com/users/temuritsutskiridze). თუ სასურველი პასუხი ვერ
// მიიღეთ (როცა response.ok არის false), გაისროლეთ ერორი და გამკლავდით მას.
// გამოიყენეთ async/await სინტაქსი.